oscillatingCylinderInChannel/base/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
#if 1
        // `fixedGradientCorrected` employs non-orthogonal corrections which are
        // required to achieve second-order accuracy on grids with
        // boundary non-orthogonality.
        type            fixedGradientCorrected;
        gradient        uniform 0;
#else
        // `zeroGradient` does NOT employ non-orthogonal corrections and hence
        // will approach zero-order accuracy for grids which contain boundary
        // non-orthogonality in the limit of mesh refinement.
        type            zeroGradient;
#endif
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
