oscillatingCylinderInChannel/base/constant/fluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fluidModel ${FLUID_MODEL:-pimpleFluid};

pimpleFluidCoeffs
{}

newtonIcoFluidCoeffs
{
    // Pressure stabilisation
    omega     [0 -2 1 0 0 0 0] 100;
    localReRef      1e6;
    omegaExponent   1.0;
    alphaU          1.0;

    // Set the pressure to zero at the centre cell
    pRefPoint       (0.5 0.2 0);
    pRefValue       0.0;

    // PETSc options file used by PETSc SNES
    optionsFile     petscOptions.pcsplit2D;
    //optionsFile     petscOptions.lu;
}

// ************************************************************************* //
