oscillatingCylinderInChannel/base/constant/meshMotionFluid/mechanicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.0                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      mechanicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

planeStress no;

mechanical
(
    fluidMesh
    {
        // type        diffusionElastic;
        type        diffusionHyperElastic;
        rho         rho [1 -3 0 0 0 0 0] 1;
        mu          mu [1 -1 -2 0 0 0 0] 1;
        //kappa       kappa [1 -1 -2 0 0 0 0] 3;
        K           K [1 -1 -2 0 0 0 0] 4;
        // regionName  region0;
        regionName  meshMotionFluid;
        // diffusivity quadratic inverseDistance
        diffusivity inverseDistance
        (
            cylinder // walls
        );

        //diffusivity inverseDistance (interface);
        //diffusivity uniform;

        writeStiffScaleFactor no;

        // type        linearElastic;
        // rho         rho [1 -3 0 0 0 0 0] 1;
        // E           E [1 -1 -2 0 0 0 0] 1;
        // nu          nu [0 0 0 0 0 0 0] 0.3;
        // regionName  meshMotionFluid;
    }
);

// ************************************************************************* //
